In [1]:
%load_ext sql

In [2]:
from sqlalchemy import create_engine

In [3]:
%sql postgresql://postgres:root@localhost/Practice

# Question

## Write SQL query to remove reduntdant duplicate rows

In [6]:
%%sql

CREATE TABLE Travel 
(
    FromLocation	VARCHAR(512),
    ToLocation	VARCHAR(512),
    Distance	INT
);

INSERT INTO Travel (FromLocation, ToLocation, Distance) VALUES
	('Kanpur', 'Unnao', '18'),
	('Unnao', 'Kanpur', '18'),
	('Unnao', 'Lucknow', '60'),
	('Unnao', 'Noida', '450'),
	('Kanpur', 'Delhi', '460'),
	('Lucknow', 'Ayodhya', '130'),
	('Ayodhya', 'Lucknow', '130'),
	('Agra', 'Delhi', '220'),
	('Mathura', 'Delhi', '140'),
	('Delhi', 'Agra', '220');

 * postgresql://postgres:***@localhost/Practice
Done.
10 rows affected.

[]

In [7]:
%%sql

SELECT * FROM Travel;

 * postgresql://postgres:***@localhost/Practice
10 rows affected.

[('Kanpur', 'Unnao', 18),
 ('Unnao', 'Kanpur', 18),
 ('Unnao', 'Lucknow', 60),
 ('Unnao', 'Noida', 450),
 ('Kanpur', 'Delhi', 460),
 ('Lucknow', 'Ayodhya', 130),
 ('Ayodhya', 'Lucknow', 130),
 ('Agra', 'Delhi', 220),
 ('Mathura', 'Delhi', 140),
 ('Delhi', 'Agra', 220)]

## Solution

In [21]:
%%sql

WITH CTE as(select *, CASE WHEN fromlocation < tolocation THEN fromlocation||tolocation
                ELSE tolocation||fromlocation END as flag
            from Travel
           )
,CTE2 as(SELECT *, ROW_NUMBER() OVER(partition by flag order by flag) as rw
                from CTE
              )
SELECT fromlocation, tolocation, distance 
FROM CTE2
WHERE rw=1

 * postgresql://postgres:***@localhost/Practice
7 rows affected.

[('Agra', 'Delhi', 220),
 ('Lucknow', 'Ayodhya', 130),
 ('Kanpur', 'Delhi', 460),
 ('Mathura', 'Delhi', 140),
 ('Kanpur', 'Unnao', 18),
 ('Unnao', 'Lucknow', 60),
 ('Unnao', 'Noida', 450)]